In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\andres c\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\andres c\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\andres c\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.5 MB 1.4 MB/s eta 0:00:08
   -- ------------------------------------- 0.8/11.5 MB 1.4 MB/s eta 0:00:08
   ---- ----------------------------------- 1.3/11.5 MB 1.7 MB/s eta 0:00:07
   ----- ---------------------------------- 1.6/11.5 MB 1.8 MB/s eta 0:00:06
   -------- ------------------------------- 2.4/11.5 MB 2.0 MB/s eta 0:00:05
   --------- ------------------------------ 2.6/11.5 MB 2.1 MB/s eta 0:00:05
   ---------- ----------------------------- 2.9/11.5 MB 2.0 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.5 MB 1.9 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.5 MB 1.9 MB/s eta 0:00:05
   ------------- -------------------------- 3.9/11.5 MB 1.8 MB/s eta 0:00:05
   -------------- ------------------------- 4.2/11.5 MB 1.8 MB/s eta 0:00:05
   --------------- ------------------------ 4.5/11.5 MB 1.7 MB/s eta 0:00:05
   ----------------- ---------------------- 5.0/11.5 MB 1.7 MB/s eta 0:00:04
   ------------------ --------------------- 5.2/11.5 MB 1.7 MB/s eta 0:00:04
   ------------------- -------------------- 5.5/11.5 MB 1.7 MB/s eta 0:00:04
   -------------------- ------------------- 5.8/11.5 MB 1.7 MB/s eta 0:00:04
   --------------------- ------------------ 6.3/11.5 MB 1.7 MB/s eta 0:00:04
   --------------------- ------------------ 6.3/11.5 MB 1.7 MB/s eta 0:00:04
   ----------------------- ---------------- 6.8/11.5 MB 1.6 MB/s eta 0:00:03
   ------------------------- -------------- 7.3/11.5 MB 1.7 MB/s eta 0:00:03
   --------------------------- ------------ 7.9/11.5 MB 1.7 MB/s eta 0:00:03
   ----------------------------- ---------- 8.4/11.5 MB 1.8 MB/s eta 0:00:02
   ------------------------------ --------- 8.7/11.5 MB 1.8 MB/s eta 0:00:02
   ------------------------------- -------- 9.2/11.5 MB 1.8 MB/s eta 0:00:02
   -------------------------------- ------- 9.4/11.5 MB 1.8 MB/s eta 0:00:02
   ----------------------------------- ---- 10.2/11.5 MB 1.8 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 1.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 1.9 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 1.9 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pandas as pd

In [10]:
import pandas as pd #Importa la librería Pandas , que se utiliza para manejar y analizar datos en forma de tablas (DataFrames).
import numpy as np #Importa NumPy , una librería que trabaja principalmente con arrays y operaciones numéricas rápidas.
#pd.DataFrame({...})Crea un DataFrame (una tabla de datos) usando un diccionario.
conos = pd.DataFrame({
    'Sabor': np.array(['mora','vainilla', 'chocolate', 'mora', 'chocolate' ]),
    'precio': np.array([3500, 4700, 6500, 5200, 5700]),
    'porcentaje': np.array(['12%', '20%', '30%', '50%', '35%'])
})
conos

       Sabor  precio porcentaje
0       mora    3500        12%
1   vainilla    4700        20%
2  chocolate    6500        30%
3       mora    5200        50%
4  chocolate    5700        35%

In [15]:
conos ['Sabor']

0         mora
1     vainilla
2    chocolate
3         mora
4    chocolate
Name: Sabor, dtype: object

In [17]:
conos['precio']

0    3500
1    4700
2    6500
3    5200
4    5700
Name: precio, dtype: int64

In [ ]:
conos[['Sabor','precio']] #Al poner esta lista dentro de los corchetes, le estás diciendo a pandas que seleccione solo las columnas escritas en los corchetes

       Sabor  precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [ ]:
conos[::-1] #Ordena la tabla de abajo hacia arriba

       Sabor  precio
4  chocolate    5700
3       mora    5200
2  chocolate    6500
1   vainilla    4700
0       mora    3500

In [6]:
conos[1:3] #El dataframe en pyhton empieza en 0, por eso el rango 1:3 selecciona las posiciones 2 y 3 de la tabla

       Sabor  precio
1   vainilla    4700
2  chocolate    6500

In [19]:
conos.sort_values(by='Sabor', ascending=True) #Organice en orden alfabetico True/False orden la orientación 
#ordena el DataFrame por la columna "Sabor" de forma ascendente (A → Z).

       Sabor  precio porcentaje
2  chocolate    6500        30%
4  chocolate    5700        35%
0       mora    3500        12%
3       mora    5200        50%
1   vainilla    4700        20%

In [21]:
conos.sort_values(by='Sabor', ascending=False) #Organice en orden alfabetico True/False orden la orientación 
#ordena el DataFrame por la columna "Sabor" de forma ascendente (A → Z).

       Sabor  precio porcentaje
1   vainilla    4700        20%
0       mora    3500        12%
3       mora    5200        50%
2  chocolate    6500        30%
4  chocolate    5700        35%

In [ ]:
conos.head(2) #Veo el comienzo de la estrucutra de arriba hacia abajo

      Sabor  precio
0      mora    3500
1  vainilla    4700

In [48]:
conos.tail(2) #Veo la estrucutura de abajo hacia arriba

       Sabor  precio
3       mora    5200
4  chocolate    5700

In [59]:
conos.sample(1) #Veo un registro al azar

  Sabor  precio
3  mora    5200

In [12]:
conos.describe() #Entrega todos los datos de abajo
#Devuelve valores como: count, mean, std, min, 25%, 50%, 75%, max para las columnas numéricas ( precio).

            precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [ ]:
conos.info() #Mostrar información generalsobre el DataFrame:Número total, norte, Tipo de datos ( int64, object, etc), Cuántos valores no nulos tiene cada columna, Uso de memoria aproximado

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sabor   5 non-null      object
 1   precio  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [ ]:
conos.index #lo que obtienes es: El índice del DataFrame, es decir, la lista (o rango) de números de fila que utilizan pandas internamente.

RangeIndex(start=0, stop=5, step=1)

In [ ]:
conos.iloc[3] #entro a la posición especifica que deseo. .iloc[]significa " ubicación por índice numérico".

Sabor     mora
precio    5200
Name: 3, dtype: object

In [88]:
#Seleccione la fila 1 en adelante, la fila 2 a la 4 y las fila 1 y 4.
conos[1:]

       Sabor  precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [91]:
conos[2:5]

       Sabor  precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [92]:
conos.iloc[[1,4]]

       Sabor  precio
1   vainilla    4700
4  chocolate    5700

In [109]:
#Selecciona el precio de la fila 3
conos['precio'][3]
conos.iloc[3,1]

np.int64(5200)

In [ ]:
# 1. Los indice con numeros debemos cambiar el indice 
conos_i=conos.set_index('Sabor', inplace=False) #Hace que la columna 'Sabor' se convierta en el índice del DataFrame
conos_i #(Si hubieras puesto inplace=True, cambiaría el conosoriginal directamente, es decir, "conos" original.

           precio
Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700

In [115]:
conos_i.index

Index(['mora', 'vainilla', 'chocolate', 'mora', 'chocolate'], dtype='object', name='Sabor')

In [126]:
conos_i.loc['chocolate'] #Accedemos a indicines no numericos

           precio
Sabor
chocolate    6500
chocolate    5700

In [135]:
conos_i.loc['vainilla','precio'] #Accedemos solo al precio de acuerdo al indice

np.int64(4700)

In [145]:
#Escoger los conos que tienen un precio mayor a 5000
conos[conos['precio'] > 5000] #Se crea una especie de mascara encerrando a conos entre parentesis por que si no aparecen valores boleanos

       Sabor  precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [147]:
conos['precio'] > 5000

0    False
1    False
2     True
3     True
4     True
Name: precio, dtype: bool

In [32]:
#Seleccionar los sabores de precios entre 3 mil y 6 mil. Seleccione los sabores de chocolate con un precio menores de 5100
conos[(conos['precio']>=3000) & (conos['precio']<=5500)]

      Sabor  precio porcentaje
0      mora    3500        12%
1  vainilla    4700        20%
3      mora    5200        50%

##Merge

In [ ]:
Valoracion = pd.DataFrame({
    'Tipo':np.array(['mora', 'chocolate', 'vainilla']),
    'calificacion':np.array([2.5, 3.5, 4])
})
Valoracion

        Tipo  calificacion
0       mora           2.5
1  chocolate           3.5
2   vainilla           4.0

In [46]:
#Como colacar calificación a la columna de helados anterior
clasificado = conos.merge(Valoracion, left_on='Sabor', right_on='Tipo') #
clasificado

       Sabor  precio porcentaje       Tipo  calificacion
0       mora    3500        12%       mora           2.5
1   vainilla    4700        20%   vainilla           4.0
2  chocolate    6500        30%  chocolate           3.5
3       mora    5200        50%       mora           2.5
4  chocolate    5700        35%  chocolate           3.5

In [52]:
clasificado = conos.merge(Valoracion, left_on='Sabor', right_on='Tipo').drop('Tipo', axis=1)
clasificado

       Sabor  precio porcentaje  calificacion
0       mora    3500        12%           2.5
1   vainilla    4700        20%           4.0
2  chocolate    6500        30%           3.5
3       mora    5200        50%           2.5
4  chocolate    5700        35%           3.5

In [ ]:
clasificado['precio/Punto N']=(clasificado['precio']/clasificado['calificacion']).round(0)
clasificado

       Sabor  precio porcentaje  calificacion  precio/Punto N
0       mora    3500        12%           2.5          1400.0
1   vainilla    4700        20%           4.0          1175.0
2  chocolate    6500        30%           3.5          1857.0
3       mora    5200        50%           2.5          2080.0
4  chocolate    5700        35%           3.5          1629.0

In [71]:
#Hacer el mismo ejercicio utilizando Join 
clasificado_2 = conos.join(Valoracion)
clasificado_2

       Sabor  precio porcentaje       Tipo  calificacion
0       mora    3500        12%       mora           2.5
1   vainilla    4700        20%  chocolate           3.5
2  chocolate    6500        30%   vainilla           4.0
3       mora    5200        50%        NaN           NaN
4  chocolate    5700        35%        NaN           NaN

In [72]:
# #Metodo Where
# clasificado.where(clasificado['Sabor']=='vainilla')
# #El metodo where=Donde se leeria asi
# #En la tabla clasificado, donde, la colunma sabor sea tenga el dato de 'vainilla'

      Sabor  precio porcentaje  calificacion  precio/Punto N
0       NaN     NaN        NaN           NaN             NaN
1  vainilla  4700.0        20%           4.0          1175.0
2       NaN     NaN        NaN           NaN             NaN
3       NaN     NaN        NaN           NaN             NaN
4       NaN     NaN        NaN           NaN             NaN

In [73]:
clasificado['Sabor']=='vainilla'

0    False
1     True
2    False
3    False
4    False
Name: Sabor, dtype: bool

##GroupBy

In [78]:
import pandas as pd

helados = pd.DataFrame({
    'Sabor': ['mora','vainilla', 'chocolate', 'mora', 'chocolate', 'vainilla' ],
    'precio': [3500, 4700, 6500, 5200, 5700, 4800],
    'ciudad' : ['Bogotá', 'Bogotá', 'Cali', 'Medellín', 'Bogotá', 'Cali']
})
helados

       Sabor  precio    ciudad
0       mora    3500    Bogotá
1   vainilla    4700    Bogotá
2  chocolate    6500      Cali
3       mora    5200  Medellín
4  chocolate    5700    Bogotá
5   vainilla    4800      Cali

In [ ]:
helados.groupby('Sabor')['precio'].mean() #Agrupar sabor y precio y saca el promedio de precios

Sabor
chocolate    6100.0
mora         4350.0
vainilla     4750.0
Name: precio, dtype: float64

In [91]:
helados.groupby('ciudad').size() #Dice el "tamaño" de las veces que la ciuedad está repetida

ciudad
Bogotá      3
Cali        2
Medellín    1
dtype: int64

In [94]:
#Precio total por sabor
helados.groupby('Sabor')['precio'].sum()

Sabor
chocolate    12200
mora          8700
vainilla      9500
Name: precio, dtype: int64

In [98]:
#obtener varias estadisticas al mismo tiempo 
helados.groupby('Sabor')['precio'].agg(['mean', 'max', 'min', 'count'])

             mean   max   min  count
Sabor
chocolate  6100.0  6500  5700      2
mora       4350.0  5200  3500      2
vainilla   4750.0  4800  4700      2

In [103]:
#Agrupar por dos columnas 
helados.groupby(['ciudad','Sabor'])['precio'].mean()

ciudad    Sabor
Bogotá    chocolate    5700.0
          mora         3500.0
          vainilla     4700.0
Cali      chocolate    6500.0
          vainilla     4800.0
Medellín  mora         5200.0
Name: precio, dtype: float64

###DropNa y FillNa

In [105]:
datos = pd.DataFrame({
    'Nombre':['Ana', 'Luis', 'Carlos', 'Marta', np.nan], 
    'Edad':[25, np.nan, 30, 22, 28],
    'Ciudad': ['Bogotá', 'Cali', np.nan, 'medellín', 'Cali']
})
datos

   Nombre  Edad    Ciudad
0     Ana  25.0    Bogotá
1    Luis   NaN      Cali
2  Carlos  30.0       NaN
3   Marta  22.0  medellín
4     NaN  28.0      Cali

In [107]:
datos.dropna() #Elimina los que tienen columnas vacias

  Nombre  Edad    Ciudad
0    Ana  25.0    Bogotá
3  Marta  22.0  medellín

In [129]:
datos.drop('Edad',axis=1)

   Nombre    Ciudad
0     Ana    Bogotá
1    Luis      Cali
2  Carlos       NaN
3   Marta  medellín
4     NaN      Cali

In [131]:
datos.dropna(subset=['Edad']) #Elimina toda la fila que le haga falta un dato en "edad"

   Nombre  Edad    Ciudad
0     Ana  25.0    Bogotá
2  Carlos  30.0       NaN
3   Marta  22.0  medellín
4     NaN  28.0      Cali

In [133]:
datos.fillna('Desconocido') #Rellena los valores faltantes

        Nombre         Edad       Ciudad
0          Ana         25.0       Bogotá
1         Luis  Desconocido         Cali
2       Carlos         30.0  Desconocido
3        Marta         22.0     medellín
4  Desconocido         28.0         Cali

In [135]:
datos['Edad'].fillna(datos['Edad'].mean()) #Rellena los datos faltantes en "edad" con el promedio de las edades

0    25.00
1    26.25
2    30.00
3    22.00
4    28.00
Name: Edad, dtype: float64

In [139]:
#Para guardar los datos en la tabla sin actualizarlo con un =
datos['Edad'].fillna(datos['Edad'].mean(), inplace=True)
datos

C:\Users\Andres C\AppData\Local\Temp\ipykernel_32448\3761851881.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  datos['Edad'].fillna(datos['Edad'].mean(), inplace=True)

   Nombre   Edad    Ciudad
0     Ana  25.00    Bogotá
1    Luis  26.25      Cali
2  Carlos  30.00       NaN
3   Marta  22.00  medellín
4     NaN  28.00      Cali